#include <iostream>
#include "json.hpp"
using json = nlohmann::json;
using namespace std;


int main() {

/*
{"G01":{"D":{"L1":3.141,"L2":3.141,"L3":3.141,"L4":3.141,"L5":3.141},
        "L":{"L1":3.141,"L2":3.141,"L3":3.141,"L4":3.141,"L5":3.141},
        "P":{"L1":3.141,"L2":3.141,"L3":3.141,"L4":3.141,"L5":3.141},
        "S":{"L1":3.141,"L2":3.141,"L3":3.141,"L4":3.141,"L5":3.141}}}
*/
    //for(int i=0;i<10;i++){
    string data;
    string data0 = "231423";
    string data1;
    //int i = 12;
    for(int i=0;i<10;i++){
    std::string prn = std::to_string(i);
    //data = "{\""+prn+"\":{\"D\":{\"L1\":";
    data = "\""+prn+"\":{\"D\":{\"L1\":"+data0+",\"L2\":"+data0+",\"L3\":"+data0+",\"L4\":"+data0+",\"L5\":"+data0+"},\"L\":{\"L1\":"+data0+",\"L2\":"+data0+",\"L3\":"+data0+",\"L4\":"+data0+",\"L5\":"+data0+"},\"P\":{\"L1\":"+data0+",\"L2\":"+data0+",\"L3\":"+data0+",\"L4\":"+data0+",\"L5\":"+data0+"},\"S\":{\"L1\":"+data0+",\"L2\":"+data0+",\"L3\":"+data0+",\"L4\":"+data0+",\"L5\":"+data0+"}}";
    //}
    data1.append(data);
    }
    cout<<"{"<<data1<<"}"<<endl;

  /*  //添加一个存储为double的数字
    json j;
    j["G01"]["P"]["L1"] = 3.141;
    j["G01"]["P"]["L2"] = 3.141;
    j["G01"]["P"]["L3"] = 3.141;
    j["G01"]["P"]["L4"] = 3.141;
    j["G01"]["P"]["L5"] = 3.141;
    j["G01"]["L"]["L1"] = 3.141;
    j["G01"]["L"]["L2"] = 3.141;
    j["G01"]["L"]["L3"] = 3.141;
    j["G01"]["L"]["L4"] = 3.141;
    j["G01"]["L"]["L5"] = 3.141;
    j["G01"]["S"]["L1"] = 3.141;
    j["G01"]["S"]["L2"] = 3.141;
    j["G01"]["S"]["L3"] = 3.141;
    j["G01"]["S"]["L4"] = 3.141;
    j["G01"]["S"]["L5"] = 3.141;
    j["G01"]["D"]["L1"] = 3.141;
    j["G01"]["D"]["L2"] = 3.141;
    j["G01"]["D"]["L3"] = 3.141;
    j["G01"]["D"]["L4"] = 3.141;
    j["G01"]["D"]["L5"] = 3.141;
*/

/*

        {"pi", 3.141},
        {"happy", true},
        {"name", "Niels"},
        {"nothing", nullptr},
        {"answer", {
            {"everything", 42}
        }},
        {"list", {1, 0, 2}},
        {"object", {
            {"currency", "USD"},
            {"value", 42.99}
        }}
    };
    */
    //cout << j << endl;

    return 0;
}
